In [38]:
import pandas as pd
import numpy as np

In [35]:
dic={'name1':['ram','sam','pam']}
dic

{'name1': ['ram', 'sam', 'pam']}

In [39]:
df=pd.DataFrame(dic)
df

  name1
0   ram
1   sam
2   pam

In [37]:
df.values # it shows the values

array([['ram'],
       ['sam'],
       ['pam']], dtype=object)

In [40]:
df.count # count is done on the index

<bound method DataFrame.count of   name1
0   ram
1   sam
2   pam>

# Sort by ascending order

In [45]:
df.sort_values(by='name1',ascending=True)

  name1
2   pam
0   ram
1   sam

# Sort by descending order

In [46]:
df.sort_values(by='name1',ascending=False)

  name1
1   sam
0   ram
2   pam

In [49]:
dic2={'col1':[2,1,100,4]}
df=pd.DataFrame(dic2)
df

   col1
0     2
1     1
2   100
3     4

In [50]:
df.sort_values(by='col1',ascending=False)

   col1
2   100
3     4
0     2
1     1

In [51]:
df.sort_values(by='col1',ascending=True)

   col1
1     1
0     2
3     4
2   100